Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/social_welfare_payments_and_work/help_with_low_pay.html.txt.tmx
Source language: en
Languages: ga

source: Help with low pay
ga: Cúnamh do dhaoine ar phá iseal

source: There are some tax and social welfare measures which help employees on low pay
ga: Tugtar cúnamh do fhostaithe ar phá íseal tríd an gcóras cánach agus tríd an gcóras leasa shóisialaigh

source: Family Income Supplement is a weekly tax-free payment that gives help to those on low pay
ga: Is íocaíocht sheachtainiúil saor ó cháin é an Forlíonadh Ioncaim Teaghlaigh a chuidíonn le daoine ar phá íseal

source: It is available to employees with children
ga: Tá sé ar fáil ag fostaithe a bhfuil clann acu

source: Getting social welfare payments
ga: Íocaíochtaí leasa shóisialaigh a fháil

source: In certain circumstances, you are allowed to keep social welfare payments (or at least part of them) when you start work
ga: Faoi chúinsí áirithe, ceadaítear duit íocaíochtaí leasa shóisialaigh a choimeád (nó cuid díobh ar a laghad) nuair a thosaíonn tú ag oibriú

source: If you work part-time up to 3 days per week you may be entitled to retain part of your Jobseeker's Benefit or Jobseeker's Allowance
ga: Má oibríonn tú go páirtaimseartha ar feadh a mhéid agus 3 lá sa tseachtain, d’fhéadfá bheith i dteideal cuid de do Shochar Cuardaitheora Poist nó de do Liúntas Cuardaitheora Poist a choimeád

source: If you are getting One-Parent Family Payment you are allowed to earn a certain amount each week and keep your payment
ga: Má tá Íocaíocht Teaghlach Aontuismitheora á fáil agat, is féidir leat méid áirithe a thuilleamh gach seachtain agus d’íocaíocht a choimeád

source: If you are getting a means-tested disability payment, such as Disability Allowance or Blind Pension, you may earn a certain amount from rehabilitative work without it affecting your payment
ga: Má tá íocaíocht mhíchumais a ndéantar tástáil mhaoine ina leith, ar nós Liúntas Míchumais nó Phinsean na nDall, is féidir leat méid áirithe a thuilleamh ó obair athshlánaithe gan aon difear a dhéanamh do d’íocaíocht

source: If you are getting Illness Benefit (for at least 6 months) or Invalidity Pension you can apply for Partial Capacity Benefit and keep part of your payment, depending on how restricted your capacity for work is
ga: Má tá Sochar Breoiteachta á fháil agat (ar feadh 6 mhí ar a laghad) nó Pinsean Easláinte, is féidir leat iarratas a dhéanamh don Sochar Páirtchumais agus cuid de d’íocaíocht a choimeád, ag brath ar cé chomh srianta atá do chumas chun oibre

source: Back to Work Enterprise Allowance
ga: Forlíonadh Cíosa a chionneáil

source: Under this scheme you can become self-employed and keep a certain amount of your social welfare payment. Find out more about the Back to Enterprise Work Allowance
ga: Ón 5 Meitheamh 2007, má bhí tú dífhostaithe nó mura raibh tú fostaithe go lán-aimseartha ar feadh 12 mhí ar a laghad agus má dheimhnítear go bhfuil tú i ngátar tithíochta faoin Scéim Chóiríochta ar Cíos tar éis measúnú a dhéanamh ort, d’fhéadfá bheith i dteideal d’Fhorlíonadh Cíosa a choimeád

source: From 5 June 2007 if you have been unemployed or not in full-time employment for at least 12 months and are assessed as in need of housing under the Rental Accommodation Scheme you may be entitled to retain your Rent Supplement
ga: Faoi na scéimeanna seo, is féidir leat a bheith féinfhostaithe agus méid áirithe de d'íocaíocht leasa shóisialaigh a choimeád. Tá tuilleadh eolais ar fáil faoin an Liúntas Fiontraíochta um Fhilleadh ar Obair

source: If you are unemployed and you are returning to full-time or part-time work, you can keep your medical card for 3 years provided you have been getting one of the following for 12 months or more:
ga: Má tá tú dífhostaithe agus má tá tú ar filleadh ar obair lánaimseartha nó pháirtaimseartha, is féidir leat do chárta leighis a choimeád ar feadh 3 bliana, a fhad agus a bhí ceann de na liúntais nó sochair a leanas á fháil agat ar feadh 12 mhí nó níos faide:

source: • Have been on an employment incentive scheme or educational opportunity scheme
ga: • Bhí tú rannpháirteach i scéim dreasacht fostaíochta nó i scéim deiseanna oideachais

source: If you take up full-time employment you will retain your medical card for 3 years from the date you start work
ga: Má ghlacann tú le fostaíocht lánaimseartha, coimeádfaidh tú do chárta leighis ar feadh 3 bliana ón dáta a thosaíonn tú ag oibriú

source: If you take up part-time employment the three-year period starts from the date your income exceeds the relevant medical card guideline
ga: Má ghlacann tú le fostaíocht pháirtaimseartha, tosaíonn an tréimhse thrí bliana ón dáta a sháraíonn d’ioncam an treoirlíne chuí don chárta leighis

source: If you are on low pay you may not be liable to pay any tax because your tax credits and reliefs are more than or equal to the amount of tax you are due to pay
ga: Má thuilleann tú ísealphá, tharlódh nach mbeifeá faoi dhliteanas aon cháin a íoc de bharr gur cothrom leis an méid cánach atá ort íoc, nó níos mó, iad do chreidmheasanna agus d’fhaoiseamh cánach

source: People with an income below €10,036 do not pay the Universal Social Charge (USC)
ga: Ní íocann daoine ag a bhfuil iocam faoi bhun €10,036 nó ag a bhfuil cárta leighis an Muirear Sóisialta Uilíoch (MSU)

source: People aged 65 and over are subject to the same general tax rules as everyone else but they do get tax exemption limits below which they pay no tax and some extra tax credits
ga: Tá daoine níos sine ná 65 bliain faoi réir na rialacha céanna ginearálta cánach amhail gach duine eile, ach faigheann siadsan teorainneacha díolúine chánach a chiallaíonn nach n-íocann siad cáin má ghabhann siad faoi na teorainneacha sin agus faigheann siad roinnt creidmheasanna breise cánach

source: Revenue's information leaflet Tax Exemption and Marginal Relief (IT 8) (pdf) gives information on available exemption limits and tax relief
ga: Tá tuilleadh eolais maidir le teorainn faoiseamh cánach agus faoiseamh imeallach le fáil ar an mbileog, Díolúine ó Cháin Ioncaim & Faoiseamh Imeallach, IT 8 ó na Coimisinéirí Ioncaim

source: If you have overpaid income tax or Universal Social Charge, then you can claim a tax refund
ga: Má bhíonn ró-íocaíocht cánach nó Muirear Sóisialta Uilíoch déanta agat, is féidir leat aisíoc cánach a éileamh

source: Further information about tax is also available from your nearest tax office
ga: Tá tuilleadh eolais le fáil ó d’oifig chánach áitiúil freisin

source: If you earn between €38 and €352 you do not have to pay PRSI
ga: Má tá tú ag tuilleamh idir €38 agus €352 comhlán, ní chaithfidh tú aon ÁSPC a íoc

source: However, your employer pays PRSI
ga: Áfach, íocann d’fhostóir ÁSPC

source: More information can be found in our document about your employer's duty to pay social insurance
ga: Tá tuilleadh eolais ar fáil inár ndoiciméad faoi dhualgas d’fhostóra árachas sóisialta a íoc
